In [1]:
with open('btc-market-price.csv','r') as fp:
    print(fp)

<_io.TextIOWrapper name='btc-market-price.csv' mode='r' encoding='cp1252'>

In [2]:
with open('btc-market-price.csv','r') as fp:
    for index , line in enumerate(fp.readlines()):
        if (index <10):
            print(index, line)

0 2017-04-02 00:00:00,1099.169125

1 2017-04-03 00:00:00,1141.813

2 2017-04-04 00:00:00,1141.6003625

3 2017-04-05 00:00:00,1133.0793142857142

4 2017-04-06 00:00:00,1196.3079375

5 2017-04-07 00:00:00,1190.45425

6 2017-04-08 00:00:00,1181.1498375

7 2017-04-09 00:00:00,1208.8005

8 2017-04-10 00:00:00,1207.744875

9 2017-04-11 00:00:00,1226.6170375

In [3]:
with open('btc-market-price.csv','r') as fp:
    for index , line in enumerate(fp.readlines()):
        if (index <10):
            timestamp, price=line.split(',')
            print(f'{timestamp}:${price}')

2017-04-02 00:00:00:$1099.169125

2017-04-03 00:00:00:$1141.813

2017-04-04 00:00:00:$1141.6003625

2017-04-05 00:00:00:$1133.0793142857142

2017-04-06 00:00:00:$1196.3079375

2017-04-07 00:00:00:$1190.45425

2017-04-08 00:00:00:$1181.1498375

2017-04-09 00:00:00:$1208.8005

2017-04-10 00:00:00:$1207.744875

2017-04-11 00:00:00:$1226.6170375

In [4]:
import csv

In [5]:
with open('btc-market-price.csv','r') as fp:
    for index , line in enumerate(fp.readlines()):
        if (index <10):
            timestamp, price=line.split(',')
            print(f'{timestamp}:${price}')

2017-04-02 00:00:00:$1099.169125

2017-04-03 00:00:00:$1141.813

2017-04-04 00:00:00:$1141.6003625

2017-04-05 00:00:00:$1133.0793142857142

2017-04-06 00:00:00:$1196.3079375

2017-04-07 00:00:00:$1190.45425

2017-04-08 00:00:00:$1181.1498375

2017-04-09 00:00:00:$1208.8005

2017-04-10 00:00:00:$1207.744875

2017-04-11 00:00:00:$1226.6170375

In [7]:
import pandas as pd 
import numpy as np

In [8]:
csv_url = "https://raw.githubusercontent.com/datasets/gdp/master/data/gdp.csv"

pd.read_csv(csv_url).head()

  Country Name Country Code  Year         Value
0   Arab World          ARB  1968  2.576068e+10
1   Arab World          ARB  1969  2.843420e+10
2   Arab World          ARB  1970  3.138550e+10
3   Arab World          ARB  1971  3.642691e+10
4   Arab World          ARB  1972  4.331606e+10

In [9]:
df = pd.read_csv('btc-market-price.csv',
                 header=None)

In [10]:
df

                       0            1
0    2017-04-02 00:00:00  1099.169125
1    2017-04-03 00:00:00  1141.813000
2    2017-04-04 00:00:00  1141.600363
3    2017-04-05 00:00:00  1133.079314
4    2017-04-06 00:00:00  1196.307937
..                   ...          ...
360  2018-03-28 00:00:00  7960.380000
361  2018-03-29 00:00:00  7172.280000
362  2018-03-30 00:00:00  6882.531667
363  2018-03-31 00:00:00  6935.480000
364  2018-04-01 00:00:00  6794.105000

[365 rows x 2 columns]

In [11]:
df.head()

                     0            1
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [12]:
df = pd.read_csv('btc-market-price.csv',
                 header=None,
                 na_values=['', '?', '-'],
                 names=['Timestamp', 'Price'])

In [13]:
df

               Timestamp        Price
0    2017-04-02 00:00:00  1099.169125
1    2017-04-03 00:00:00  1141.813000
2    2017-04-04 00:00:00  1141.600363
3    2017-04-05 00:00:00  1133.079314
4    2017-04-06 00:00:00  1196.307937
..                   ...          ...
360  2018-03-28 00:00:00  7960.380000
361  2018-03-29 00:00:00  7172.280000
362  2018-03-30 00:00:00  6882.531667
363  2018-03-31 00:00:00  6935.480000
364  2018-04-01 00:00:00  6794.105000

[365 rows x 2 columns]

In [14]:
df.head()

             Timestamp        Price
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [15]:
df = pd.read_csv('btc-market-price.csv',
                 header=None,
                 na_values=['', '?', '-'],
                 names=['Timestamp', 'Price'],
                 dtype={'Price': 'float'})

In [16]:
df.head()

             Timestamp        Price
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [17]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

In [18]:
pd.to_datetime(df['Timestamp']).head()

0   2017-04-02
1   2017-04-03
2   2017-04-04
3   2017-04-05
4   2017-04-06
Name: Timestamp, dtype: datetime64[ns]

In [19]:
df['Timestamp'] = pd.to_datetime(df['Timestamp'])

In [20]:
df.head()

   Timestamp        Price
0 2017-04-02  1099.169125
1 2017-04-03  1141.813000
2 2017-04-04  1141.600363
3 2017-04-05  1133.079314
4 2017-04-06  1196.307937

In [21]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [22]:
df = pd.read_csv('btc-market-price.csv',
                 header=None,
                 na_values=['', '?', '-'],
                 names=['Timestamp', 'Price'],
                 dtype={'Price': 'float'},
                 parse_dates=[0],
                 index_col=[0])

In [23]:
df.head()

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937

In [30]:
import sqlite3

In [31]:
conn = sqlite3.connect('chinook.db')

In [32]:
cur = conn.cursor()

In [36]:
#cur.execute('SELECT * FROM employees LIMIT 5;')

In [34]:
results = cur.fetchall()

In [35]:
results

[]